<html>
<head> 
	<title> 
    	Blog De KuKi 
    </title> 
    <link rel="stylesheet" href="AyudaCSS.css" type="text/css">
</head>
<body>
	<h3> Introduccion a Algoritmos </h3>
    <table id="ayuda">
    	<tr> 
		<td> 
        	<p>
        		Un algoritmo es un conjunto de instrucciones que conducen a la solución de un problema o situación por resolver. 
                Un algoritmo expresa un procedimiento paso a paso para solucionar un problema dado. Por ejemplo, supongamos 
                que deseamos hacer una llamada telefónica. Elaboremos una lista de pasos, para que podamos hacerla, digamos 
                algo similar a lo siguiente: 1. Tomar el teléfono, 2. Marcar el número telefónico, 3. Esperar a que contesten, 
                4. Platicar un rato y 5. Terminar la llamada. De esta manera, tenemos una forma ordenada de realizar, en este 
                caso, una llamada telefónica. Entonces, tenemos un algoritmo para tal fin. Sin embargo, los algoritmos 
                pueden considerar diferentes situaciones que pudieran presentarse</p>  
            <p>
            	Las características que debe cumplir un algoritmo son ser: 
                <ol>
                	<li> <b>Preciso</b>, para indicar el orden de realización de cada paso. 
                    <li> <b>Definido</b>, de manera que si un algoritmo se sigue dos veces, se debe obtener el mismo resultado 
                    cada vez. 
                    <li> <b>Finito</b>, es decir, debe tener un número finito de pasos. 
            	</ol>
            </p>    
            <p>   
                Un algoritmo debe de constar de tres partes: 
                <ol>
                	<li> <b>Entrada</b>, que es la información que se le proporciona al algoritmo.
                    <li> <b>Proceso</b>, que es la realización de las operaciones necesarias para producir la salida.
                    <li> <b>Salida</b>, que es la información producida por el algoritmo.
                </ol>
            </p>     
        </td> 
		</tr>
        <tr>
        <td>
        	<h3> Diagramas de Flujo</h3>
        </td> 
      	</tr>
        <tr>
        <td
        	<p>
            	Los diagramas de flujo son una herramienta para la representación de algoritmos, en la cual utiliza s&iacute;mbolos
                que est&aacute;n unidos por flechas. Cada s&iacute;mbolo tiene un significado y las flechas, denominadas 
                l&iacute;neas de flujo, indican la secuencia que tienen los s&iacute;mbolos. Cada uno de los s&iacute;mbolos 
                de los diagramas de flujo indican el tipo de operaci&oacute;n a realizar y el diagrama de flujo muestra 
                gr&aacute;ficamente la secuencia en la que se realizar&aacute;n las operaciones. Las l&iacute;neas de 
                flujo representan el flujo secuencial de la l&oacute;gica del algoritmo. Un rect&aacute;ngulo () significa 
                alg&uacute;n tipo de proceso, es decir, acciones a realizar. El paralelogramo es un s&iacute;mbolo 
                de entrada/salida que representa cualquier tipo de entrada o salida del algoritmo. El s&iacute;mbolo 
                rombo es una caja de decisi&oacute;n que representa respuestas s&iacute;/no o bien diferentes alternativas. 
                Un s&iacute;mbolo terminal se usa en los diagramas de flujo para indicar su comienzo y terminaci&oacute;n. 
                Un pequeño c&iacute;rculo es un conector y se utiliza para conectar caminos, tras roturas previas en el 
                flujo del algoritmo.
            </p>
        </td> 
      	</tr>
    </table>
</body> 
</html>